In [2]:
from numpy import random as r
print(r.randint(1,100))
print(r.rand())

48
0.17091081226447646

In [4]:
a = r.randint(100,size=(3,2)).ravel()
a

array([39, 41, 47,  3, 17, 93])

In [7]:
r.choice([1,2,3,4,5],size=(5,5))

array([[2, 3, 2, 3, 3],
       [5, 4, 2, 3, 3],
       [5, 1, 4, 2, 1],
       [2, 1, 5, 5, 4],
       [5, 2, 1, 4, 1]])

## Pandas:
1. Data manipulations,analysis and cleaning
2. Tabular,Unlabeled

### Creating data frame
1. using 2 dictionaries

In [5]:
import numpy as np
import pandas as pd
dict1 = {'a':1,'b':2,'c':3,'d':4,'e':5}
dict2 = {'a':5,'b':6,'c':7,'d':8,'e':9}
data = {"First":dict1,"Second":dict2}
df = pd.DataFrame(data,dtype=np.int32)

In [6]:
df

   First  Second
a      1       5
b      2       6
c      3       7
d      4       8
e      5       9

2. Simple dictionary --> Dataframe

In [8]:
d1 = {"name":["venkat","gopi","nikhil"],"address":["hyd","abd","AP"]}
df1 = pd.DataFrame(d1)
df1

     name address
0  venkat     hyd
1    gopi     abd
2  nikhil      AP

3. series

In [26]:
s1 = pd.Series([1,2,3,4,5,6,7,8,9,10])
s2 = pd.Series([12.23,23.34,15.3,55.3,65.3,64.6,96.7,48.2,61.2,88.2])
s3 = pd.Series(['a','b','c','d','e','f','g','h','i','j'])
data1 = {"colum1":s1,"colum":s2,"colum3":s3}
df3 = pd.DataFrame(data1)
df3

   colum1  colum colum3
0       1  12.23      a
1       2  23.34      b
2       3  15.30      c
3       4  55.30      d
4       5  65.30      e
5       6  64.60      f
6       7  96.70      g
7       8  48.20      h
8       9  61.20      i
9      10  88.20      j

In [27]:
df3["colum1"]

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
Name: colum1, dtype: int64

In [28]:
type(df3)

pandas.core.frame.DataFrame

In [31]:
df3.loc[:,"colum1"]

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
Name: colum1, dtype: int64

In [32]:
df3.iloc[0:4,0:1]

   colum1
0       1
1       2
2       3
3       4

In [36]:
df3.iloc[:,0]

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
Name: colum1, dtype: int64

## Retrieving the information in dataframe

In [38]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   colum1  10 non-null     int64
 1   colum   10 non-null     float64
 2   colum3  10 non-null     object
dtypes: float64(1), int64(1), object(1)
memory usage: 368.0+ bytes

In [39]:
df.shape

(5, 2)

In [40]:
df3.columns

Index(['colum1', 'colum', 'colum3'], dtype='object')

### Viewing data from DataFrame:
1. head()
2. tail()
3. Sample()

In [47]:
df3.head(6)

   colum1  colum colum3
0       1  12.23      a
1       2  23.34      b
2       3  15.30      c
3       4  55.30      d
4       5  65.30      e
5       6  64.60      f

In [46]:
df3.tail(2)

   colum1  colum colum3
8       9   61.2      i
9      10   88.2      j

In [45]:
df3.sample(2)

   colum1  colum colum3
8       9   61.2      i
7       8   48.2      h

In [48]:
df3.describe()

         colum1      colum
count  10.00000  10.000000
mean    5.50000  53.037000
std     3.02765  28.854683
min     1.00000  12.230000
25%     3.25000  29.555000
50%     5.50000  58.250000
75%     7.75000  65.125000
max    10.00000  96.700000

In [51]:
df3 = df3.rename(columns={"colum1":"column1","colum":"column2","colum3":"column3"})
df3

   column1  column2 column3
0        1    12.23       a
1        2    23.34       b
2        3    15.30       c
3        4    55.30       d
4        5    65.30       e
5        6    64.60       f
6        7    96.70       g
7        8    48.20       h
8        9    61.20       i
9       10    88.20       j